GetCopingIds Method
 Lists the elements currently used as coping cutters for this element.
 Lists the elements currently used as coping cutters for this element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public ICollection<ElementId> GetCopingIds()
  Visual Basic
Public Function GetCopingIds As ICollection(Of ElementId)
  Visual C++
public:
ICollection<ElementId^>^ GetCopingIds()
 Return Value
 The coping ElementIds
 See Also
  FamilyInstance Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →